In [2]:
import pandas as pd
import seaborn as sn

In [3]:
df  = pd.read_csv('heights.csv')
df.head()

  gender     height
0   Male  73.847017
1   Male  68.781904
2   Male  74.110105
3   Male  71.730978
4   Male  69.881796

In [4]:
df.shape

(10000, 2)

In [6]:
df.height.describe()

count    10000.000000
mean        66.367560
std          3.847528
min         54.263133
25%         63.505620
50%         66.318070
75%         69.174262
max         78.998742
Name: height, dtype: float64

In [8]:
mean = df.height.mean()
mean

66.367559754866

In [18]:
std_deviation = df.height.std()
std_deviation

3.847528120795573

In [19]:
df[(df.height > mean - 3*std_deviation) & ( df.height< mean + 3*std_deviation)]

      gender     height
0       Male  73.847017
1       Male  68.781904
2       Male  74.110105
3       Male  71.730978
4       Male  69.881796
...      ...        ...
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

[9993 rows x 2 columns]

In [22]:
df["z-score"] = (df.height - df.height.mean()) / df.height.std()
df.head()

  gender     height   z-score
0   Male  73.847017  1.943964
1   Male  68.781904  0.627505
2   Male  74.110105  2.012343
3   Male  71.730978  1.393991
4   Male  69.881796  0.913375